# # щелчок 2023
#
# # 3
# #1678x12_16 +1x024_16
s = 1*16**6+6*16**5+7*16**4+8*16**3+1*16**1+2*16**0 + 1*16**4+0*16**2+2*16**1+4*16**0
for x in range(16):
    sx = s + x*16**2 + x*16**3
    if x % 15 == 0:
        print(x)
#
#
#
#
#
#
#
#
#
#
#
#
#
# # 2
# s = 1*6**3+3*6**1+4*6**0 + 2*4**3+3*4**2+1*4**0
# for x in range(0, 4+1):
#     sx = s + x * 6 ** 2 + x * 4 ** 1
#     if sx % 7 == 0:
#         print(x, sx // 7)  # // - частное от деления
#
# # 1
# k = 0
# x = 9**2022 + 8**2012
# while x>0:
#     if x%3==0:
#         k+=1
#     x//=3
# print(k)
#
#
# a = 2 * 729 ** 1021 - 2 * 243 ** 1022 + 81 ** 1023 - 2 * 27 ** 1024 - 1025
# k = 0
# while a:
#     if a % 3 == 0:
#         k += 1
#     a //= 3
# print(k)
#
#
# # Имаев Артем
# # внимательно переписывать выражения
# s = 2*17**4 + 6*17**3 + 3*17**1 + 4 + 3 * 17 ** 4 + 5 * 17 ** 2 + 9 * 17 + 7
#
# for x in range(0, 16 + 1):
#     sx = s + x * 17 ** 3 + x * 17 ** 2
#     if sx % 13 == 0:
#         print(x, sx // 13)  # // - частное от деления
#
#
# s = (1+2)*16**4 + 12*16**3 + 11*16**2 + (10+15)*16 + 13 + 14
# for x in range(0, 15+1):
#     sx = s + x*16**3 + x*16**2
#     # sx = s + сумма иксов
#     if sx % 15 == 0:
#         print(x, sx // 15)
#
#
# s = (9+3)*17**4 + 7*17**3 + (5+1)*17**2 + (9+0)*17 + 8
# for x in range(0,16+1):
#     sx = s + x + x*17**3
#     if sx % 11 == 0:
#         print(x, sx // 11)
#
#
# # при разных СЧ используем минимальную СЧ
# s = 1*15**4 + 3*15**3 + 1*15**2 + 1 + 1*17**3 + 3*17**2 + 3
# for x in range(0,15):
#     sx = s + x*15 + x*17
#     if sx % 11 == 0:
#         print(x, sx // 11)
#
#
# s = 2*22**3 + 3*22**2 + 5 - 6*13**4 - 7*13**3 - 9*13
# for x in range(0, 22):
#     for y in range(0, 13):
#         sxy = s + x*22**4 + x*22 - y*13**2 - y
#         if sxy % 57 == 0:
#             print(x, y, sxy // 57)
#
#
# m = 2*15**5 + 2*15**3 + 3*15**2 + 5
# n = 6*13**4 + 7*13**3 + 9*13
# for a in range(1,10000):
#     for x in range(15):
#         for y in range(13):
#             mxy = m + y*15**4 + x*15
#             nxy = n + x*13**2 + y
#             if (mxy + a) % nxy == 0:
#                 print(a, x, y)
#                 exit()  # то же самое что и break в while()
